In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import warnings
warnings.filterwarnings("ignore")

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

/kaggle/input/bank-dataset/Bank_Customer.csv

In [2]:
df=pd.read_csv("/kaggle/input/bank-dataset/Bank_Customer.csv")
df

       age           job  marital  education  balance duration
0     58.0    management  married   tertiary     2143      261
1     44.0    technician   single  secondary       29      151
2     33.0  entrepreneur  married  secondary        2       76
3     47.0   blue-collar  married    unknown     1506       92
4     33.0       unknown   single    unknown        1      198
...    ...           ...      ...        ...      ...      ...
1085   NaN        admin.  married    primary      136      283
1086   NaN   blue-collar   single    unknown     2167     1273
1087   NaN   blue-collar  married  secondary      309     1574
1088   NaN    technician  married  secondary      221      139
1089   NaN   blue-collar  married    primary      321      228

[1090 rows x 6 columns]

In [3]:
df.shape

(1090, 6)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1090 entries, 0 to 1089
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        1000 non-null   float64
 1   job        1090 non-null   object
 2   marital    1090 non-null   object
 3   education  1090 non-null   object
 4   balance    1090 non-null   int64
 5   duration   1090 non-null   object
dtypes: float64(1), int64(1), object(4)
memory usage: 51.2+ KB

In [5]:
df.duplicated().sum()

0

In [6]:
df.isna().sum()

age          90
job           0
marital       0
education     0
balance       0
duration      0
dtype: int64

In [7]:
df['age']=df['age'].fillna(df['age'].mean())

In [8]:
df['age'].describe()

count    1090.000000
mean       42.582000
std         8.687159
min        22.000000
25%        36.000000
50%        42.582000
75%        49.000000
max        61.000000
Name: age, dtype: float64

In [9]:
df['job'].value_counts()

job
blue-collar      333
technician       163
admin.           149
management       146
services         141
retired           47
entrepreneur      32
self-employed     27
unemployed        23
student           14
housemaid         10
unknown            5
Name: count, dtype: int64

In [10]:
df['education'].value_counts()

education
secondary    613
tertiary     197
primary      186
unknown       94
Name: count, dtype: int64

In [11]:
df['job'].replace("unknown",df['job'].mode()[0],inplace=True)
df['education'].replace("unknown",df['education'].mode()[0],inplace=True)

In [12]:
df['marital'].value_counts()

marital
married     693
single      241
divorced    156
Name: count, dtype: int64

In [13]:
# list unemployes and their age and marital
jobg=df.groupby('job')
jobg[['marital','age','education']].value_counts().loc['unemployed']

marital   age   education
married   43.0  secondary    2
          48.0  secondary    2
          55.0  tertiary     2
single    40.0  secondary    2
divorced  30.0  secondary    1
          37.0  primary      1
                secondary    1
          55.0  secondary    1
married   29.0  tertiary     1
          31.0  secondary    1
          32.0  secondary    1
          35.0  secondary    1
          39.0  primary      1
          40.0  secondary    1
          46.0  secondary    1
          53.0  secondary    1
          57.0  tertiary     1
single    28.0  tertiary     1
          33.0  tertiary     1
Name: count, dtype: int64

In [14]:
# list customers jobs and education
jobg['education'].value_counts()

job            education
admin.         secondary    134
               tertiary       8
               primary        7
blue-collar    secondary    212
               primary      123
               tertiary       3
entrepreneur   secondary     16
               tertiary      12
               primary        4
housemaid      primary        6
               secondary      2
               tertiary       2
management     tertiary     110
               secondary     33
               primary        3
retired        secondary     28
               primary       15
               tertiary       4
self-employed  secondary     11
               tertiary      11
               primary        5
services       secondary    120
               primary       15
               tertiary       6
student        secondary     11
               tertiary       3
technician     secondary    125
               tertiary      32
               primary        6
unemployed     secondary     15
               tertiary       6
               primary        2
Name: count, dtype: int64

In [15]:
# balance mean,max,min for customer job
jobg['balance'].agg(['mean','max','min'])

                     mean    max  min
job
admin.         737.449664  58544 -497
blue-collar    401.677515  12223 -932
entrepreneur   372.250000   1722 -184
housemaid      981.900000   6920    0
management     839.116438  24598 -248
retired        534.680851   7624 -331
self-employed  275.629630   2303 -364
services       486.893617   8823 -291
student        304.714286    948    0
technician     668.263804  45248 -500
unemployed     472.869565   5345 -825

In [16]:
df['balance'].describe()

count     1090.000000
mean       564.387156
std       2553.749723
min       -932.000000
25%         22.000000
50%        173.000000
75%        443.500000
max      58544.000000
Name: balance, dtype: float64

In [17]:
df.loc[df['balance']==0,['balance','duration']]

      balance duration
19          0       54
24          0      181
33          0      226
39          0      137
47          0      225
...       ...      ...
1000        0      164
1044        0      229
1070        0      234
1077        0      191
1080        0      112

[97 rows x 2 columns]

In [18]:
df.sort_values(by=['balance'],ascending=False)

      age          job   marital  education  balance duration
920  44.0       admin.   married  secondary    58544      144
446  39.0   technician    single  secondary    45248     1623
334  45.0   management  divorced   tertiary    24598      313
69   35.0  blue-collar    single  secondary    12223      177
34   51.0   management   married   tertiary    10635      336
..    ...          ...       ...        ...      ...      ...
462  43.0  blue-collar   married  secondary     -509      124
838  35.0  blue-collar    single  secondary     -532      149
100  44.0  blue-collar   married  secondary     -674      257
974  31.0   unemployed   married  secondary     -825      179
934  54.0  blue-collar   married  secondary     -932      799

[1090 rows x 6 columns]

In [19]:
# balance for education
edug=df.groupby('education')
edug['balance'].agg(['mean','max','min'])

                 mean    max  min
education
primary    342.822581   5431 -454
secondary  564.452617  58544 -932
tertiary   773.345178  24598 -364

In [20]:
# balance for marital
mari=df.groupby('marital')
mari['balance'].agg(['mean','max','min'])

                mean    max  min
marital
divorced  586.750000  24598 -349
married   538.919192  58544 -932
single    623.145228  45248 -532